--参照完整性测试
--参照完整性规则(约束):外键或者取空值,或者取主键表已有的主键值

--以外键表为视角考虑参照完整性规则

--在外键表中插入新元组
--插入的新元组的外键值在主键表中
USE JXGL
GO
    INSERT INTO SC
    VALUES('100007','C007',98)
GO
--运行结果:符合参照完整性约束,系统执行插入操作

--插入的新元组的外键值不在主键表中
USE JXGL
GO
    INSERT INTO SC
    VALUES('100032','C008',98)
GO
--运行结果:不符合参照完整性约束,系统报错

--修改外键表中元组
--被修改的外键表中的元组外键值在外键表当中
USE JXGL
GO 
    UPDATE SC
    SET SNO='100009'
    WHERE SNO='100031'
GO 
--运行结果:符合参照完整性规则,系统在外键表中执行修改操作,主键表不修改

--被修改的外键表中的元组外键值不在外键表当中
USE JXGL
GO 
    UPDATE SC
    SET SNO='100032'
    WHERE SNO='100009'
GO 
--运行结果:违反参照完整性规则,系统报错

--外键表删除元组,由于外键表删除与参照完整性规则无关,系统无条件执行相应操作
USE JXGL
GO 
    DELETE FROM SC 
    WHERE SNO='100031'
GO 

--以主键表为视角(出发),主键更新制约外键表更新
--删除主键表中具有其主键是外键表中某元组的外键的元组
USE JXGL
GO 
    DELETE FROM S
    WHERE SNO='100009'
GO 
--运行结果:主键表的删除引发外键表(隐式)级联删除

--修改主键表中具有其主键是外键表中某元组的外键的元组
USE JXGL
GO 
    UPDATE S
    SET SNO='100011'
    WHERE SNO='100008'
GO 
--运行结果:由于没有显式定义级联修改,所以违反参照完整性,系统报错

--主键表插入和参照完整性规则无关联,系统无条件执行主键表插入新元组
USE JXGL
GO 
    INSERT INTO S
    VALUES('100032','WANG','M',21,'IS')
GO 